{"keras_version": "2.1.1", "class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["lambda_6", 0, 0]], "name": "model_3", "input_layers": [["input_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 320, 320, 3], "name": "input_1"}, "inbound_nodes": []}, {"name": "reflection_padding2d_1", "class_name": "ReflectionPadding2D", "config": {"name": "reflection_padding2d_1", "trainable": true}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_1", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [9, 9], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["reflection_padding2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_1", "axis": -1}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [2, 2], "name": "conv2d_2", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_2", "axis": -1}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [2, 2], "name": "conv2d_3", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_3", "axis": -1}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_4", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_4", "axis": -1}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "conv2d_5", "class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_5", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_5", "axis": -1}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0005\u0000\u0000\u0000S\u0000\u0000\u0000s#\u0000\u0000\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0002\u0000\u0085\u0002\u0000d\u0001\u0000d\u0003\u0000\u0085\u0002\u0000f\u0003\u0000\u0019S)\u0004N\u00e9\u0002\u0000\u0000\u0000\u00e9\u00fe\u00ff\u00ff\u00ffr\u0002\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001f<ipython-input-17-77ee1f2d0412>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "trainable": true, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_1"}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "add_1", "class_name": "Add", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}], ["lambda_1", 0, 0, {}]]]}, {"name": "conv2d_6", "class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_6", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_6", "axis": -1}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"name": "conv2d_7", "class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_7", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_7", "axis": -1}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0005\u0000\u0000\u0000S\u0000\u0000\u0000s#\u0000\u0000\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0002\u0000\u0085\u0002\u0000d\u0001\u0000d\u0003\u0000\u0085\u0002\u0000f\u0003\u0000\u0019S)\u0004N\u00e9\u0002\u0000\u0000\u0000\u00e9\u00fe\u00ff\u00ff\u00ffr\u0002\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001f<ipython-input-17-77ee1f2d0412>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "trainable": true, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_2"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"name": "add_2", "class_name": "Add", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}], ["lambda_2", 0, 0, {}]]]}, {"name": "conv2d_8", "class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_8", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_8", "axis": -1}, "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "conv2d_9", "class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_9", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "batch_normalization_9", "class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_9", "axis": -1}, "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0005\u0000\u0000\u0000S\u0000\u0000\u0000s#\u0000\u0000\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0002\u0000\u0085\u0002\u0000d\u0001\u0000d\u0003\u0000\u0085\u0002\u0000f\u0003\u0000\u0019S)\u0004N\u00e9\u0002\u0000\u0000\u0000\u00e9\u00fe\u00ff\u00ff\u00ffr\u0002\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001f<ipython-input-17-77ee1f2d0412>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "trainable": true, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_3"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"name": "add_3", "class_name": "Add", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["batch_normalization_9", 0, 0, {}], ["lambda_3", 0, 0, {}]]]}, {"name": "conv2d_10", "class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_10", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "batch_normalization_10", "class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_10", "axis": -1}, "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"name": "conv2d_11", "class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_11", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"name": "batch_normalization_11", "class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_11", "axis": -1}, "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0005\u0000\u0000\u0000S\u0000\u0000\u0000s#\u0000\u0000\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0002\u0000\u0085\u0002\u0000d\u0001\u0000d\u0003\u0000\u0085\u0002\u0000f\u0003\u0000\u0019S)\u0004N\u00e9\u0002\u0000\u0000\u0000\u00e9\u00fe\u00ff\u00ff\u00ffr\u0002\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001f<ipython-input-17-77ee1f2d0412>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "trainable": true, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_4"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"name": "add_4", "class_name": "Add", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}], ["lambda_4", 0, 0, {}]]]}, {"name": "conv2d_12", "class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_12", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "batch_normalization_12", "class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_12", "axis": -1}, "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"name": "activation_8", "class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"name": "conv2d_13", "class_name": "Conv2D", "config": {"padding": "valid", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_13", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"name": "batch_normalization_13", "class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_13", "axis": -1}, "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"name": "lambda_5", "class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0005\u0000\u0000\u0000S\u0000\u0000\u0000s#\u0000\u0000\u0000|\u0000\u0000d\u0000\u0000d\u0000\u0000\u0085\u0002\u0000d\u0001\u0000d\u0002\u0000\u0085\u0002\u0000d\u0001\u0000d\u0003\u0000\u0085\u0002\u0000f\u0003\u0000\u0019S)\u0004N\u00e9\u0002\u0000\u0000\u0000\u00e9\u00fe\u00ff\u00ff\u00ffr\u0002\u0000\u0000\u0000\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\u001f<ipython-input-17-77ee1f2d0412>\u00da\b<lambda>\u0004\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "trainable": true, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_5"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"name": "add_5", "class_name": "Add", "config": {"name": "add_5", "trainable": true}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}], ["lambda_5", 0, 0, {}]]]}, {"name": "up_sampling2d_1", "class_name": "UpSampling2D", "config": {"size": [2, 2], "name": "up_sampling2d_1", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["add_5", 0, 0, {}]]]}, {"name": "conv2d_14", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_14", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["up_sampling2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_14", "class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_14", "axis": -1}, "inbound_nodes": [[["conv2d_14", 0, 0, {}]]]}, {"name": "activation_9", "class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"name": "up_sampling2d_2", "class_name": "UpSampling2D", "config": {"size": [2, 2], "name": "up_sampling2d_2", "data_format": "channels_last", "trainable": true}, "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"name": "conv2d_15", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "activation": "linear", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_15", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["up_sampling2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_15", "class_name": "BatchNormalization", "config": {"scale": true, "trainable": true, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "momentum": 0.99, "gamma_initializer": {"class_name": "Ones", "config": {}}, "name": "batch_normalization_15", "axis": -1}, "inbound_nodes": [[["conv2d_15", 0, 0, {}]]]}, {"name": "activation_10", "class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_15", 0, 0, {}]]]}, {"name": "conv2d_16", "class_name": "Conv2D", "config": {"padding": "same", "trainable": true, "activation": "tanh", "bias_constraint": null, "kernel_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_16", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_regularizer": null, "kernel_size": [9, 9], "filters": 3, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}}, "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"name": "lambda_6", "class_name": "Lambda", "config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000C\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0017d\u0002\u0000\u0014S)\u0003N\u00e9\u0001\u0000\u0000\u0000g\u0000\u0000\u0000\u0000\u0000\u00e0_@\u00a9\u0000)\u0001\u00da\u0001xr\u0002\u0000\u0000\u0000r\u0002\u0000\u0000\u0000\u00fa\u001f<ipython-input-20-d32ea681e468>\u00da\b<lambda>\n\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "arguments": {}, "trainable": true, "output_shape": null, "output_shape_type": "raw", "function_type": "lambda", "name": "lambda_6"}, "inbound_nodes": [[["conv2d_16", 0, 0, {}]]]}]}}